Load-test/load-test.yml
config:
  target: "https://api.demo-app.example.com"
  phases:
    # Warm up phase
    - duration: 60
      arrivalRate: 5
      name: "Warm up phase"
    # Ramp up load
    - duration: 120
      arrivalRate: 15
      name: "Ramp up load"
    # Sustained load
    - duration: 180
      arrivalRate: 25
      name: "Sustained load"
    # Ramp down
    - duration: 60
      arrivalRate: 10
      name: "Ramp down"

  http:
    timeout: 60
    pool: 100
    keepAlive: true

  plugins:
    expect: {}
    metrics-by-endpoint: {}
    apdex:
      threshold: 500 # 500ms target response time

  variables:
    testUser: "testerdrew7@yopmail.com"
    testPassword: "Test12345@"

scenarios:
  # User Login and Dashboard Access
  - name: "User Login and Dashboard Access"
    weight: 40
    flow:
      - post:
          url: "/api/v1/auth/sign-in"
          headers:
            Content-Type: "application/x-www-form-urlencoded"
          form:
            username: "{{ testUser }}"
            password: "{{ testPassword }}"
            grant_type: "password"
            client_id: "web"
          expect:
            - statusCode: [200, 500]
          capture:
            - json: "$.access_token"
              as: "authToken"
              ifUndefined: "skip"

      - think: 2

      - get:
          url: "/dashboard"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: [200, 401, 500]
          ifTrue: "authToken"

  # Assistant Management Operations
  - name: "Assistant Management Operations"
    weight: 30
    flow:
      - post:
          url: "/api/v1/auth/sign-in"
          headers:
            Content-Type: "application/x-www-form-urlencoded"
          form:
            username: "{{ testUser }}"
            password: "{{ testPassword }}"
            grant_type: "password"
            client_id: "web"
          expect:
            - statusCode: [200, 500]
          capture:
            - json: "$.access_token"
              as: "authToken"
              ifUndefined: "skip"

      - think: 1

      - get:
          url: "/api/v1/assistants"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: [200, 401, 500]
          ifTrue: "authToken"

      - think: 2

  # Call Logs Retrieval
  - name: "Call Logs Retrieval"
    weight: 20
    flow:
      - post:
          url: "/api/v1/auth/sign-in"
          headers:
            Content-Type: "application/x-www-form-urlencoded"
          form:
            username: "{{ testUser }}"
            password: "{{ testPassword }}"
            grant_type: "password"
            client_id: "web"
          expect:
            - statusCode: [200, 500]
          capture:
            - json: "$.access_token"
              as: "authToken"
              ifUndefined: "skip"

      - get:
          url: "/api/v1/calls?page=1&limit=50"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: [200, 401, 404, 500]
          ifTrue: "authToken"

  # Settings Update
  - name: "Settings Update"
    weight: 10
    flow:
      - post:
          url: "/api/v1/auth/sign-in"
          headers:
            Content-Type: "application/x-www-form-urlencoded"
          form:
            username: "{{ testUser }}"
            password: "{{ testPassword }}"
            grant_type: "password"
            client_id: "web"
          expect:
            - statusCode: [200, 500]
          capture:
            - json: "$.access_token"
              as: "authToken"
              ifUndefined: "skip"

      - get:
          url: "/api/v1/user/me"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: [200, 401, 404, 500]
          ifTrue: "authToken"