Load-test/spike-test.yml
config:
  target: "https://api.demo-app.example.com"
  phases:
    # Baseline load
    - duration: 60
      arrivalRate: 1 # Start lower
    # Spike test - sudden increase
    - duration: 30
      arrivalRate: 50
      name: "Spike"
    # Recovery period
    - duration: 300
      arrivalRate: 1 # Keep steady load lower

  http:
    timeout: 60
    pool: 100

  plugins:
    expect: {}
    metrics-by-endpoint: {}
    apdex: {}

scenarios:
  # Stress test critical endpoints
  - name: "Login Stress Test"
    weight: 50
    flow:
      - post:
          url: "/api/v1/auth/sign-in"
          headers:
            Content-Type: "application/x-www-form-urlencoded"
          form:
            username: "testerdrew7@yopmail.com"
            password: "Test12345@"
            grant_type: "password"
            client_id: "web"
          expect:
            - statusCode: [200, 400, 401, 429, 500, 503] # Include rate limiting responses
          capture:
            - json: "$.access_token"
              as: "authToken"
              ifUndefined: "skip"

      - think: 5 # Increase think time to reduce server pressure

      - get:
          url: "/dashboard"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: [200, 401, 429, 503]
          ifTrue: "authToken"

  # Stress test static resources
  - name: "Static Resources Stress"
    weight: 30
    flow:
      - get:
          url: "/"
          expect:
            - statusCode: [200, 429, 503]

      - get:
          url: "/login"
          expect:
            - statusCode: [200, 429, 503]

      - get:
          url: "/signup"
          expect:
            - statusCode: [200, 429, 503]

  # API stress test
  - name: "API Stress Test"
    weight: 20
    flow:
      - post:
          url: "/api/v1/auth/sign-in"
          headers:
            Content-Type: "application/x-www-form-urlencoded"
          form:
            username: "testerdrew7@yopmail.com"
            password: "Test12345@"
            grant_type: "password"
            client_id: "web"
          expect:
            - statusCode: [200, 400, 401, 429, 500, 503]
          capture:
            - json: "$.access_token"
              as: "authToken"
              ifUndefined: "skip"

      - get:
          url: "/api/v1/dashboard/call-count-by-category"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: [200, 401, 404, 429, 500, 503]
          ifTrue: "authToken"
          ifTrue: "authToken"

      - get:
          url: "/api/v1/voice/calls/"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: [200, 401, 429, 503]
          ifTrue: "authToken"

      - get:
          url: "/api/v1/some-endpoint"
          expect:
            - statusCode: [200, 500] # Accept 500s as non-critical during load testing